# -*- coding: utf-8 -*-
"""
Задание 15.1

Создать функцию get_ip_from_cfg, которая ожидает как аргумент имя файла,
в котором находится конфигурация устройства.

Функция должна обрабатывать конфигурацию и возвращать IP-адреса и маски,
которые настроены на интерфейсах, в виде списка кортежей:
* первый элемент кортежа - IP-адрес
* второй элемент кортежа - маска

Например (взяты произвольные адреса):
[('10.0.1.1', '255.255.255.0'), ('10.0.2.1', '255.255.255.0')]

Для получения такого результата, используйте регулярные выражения.

Проверить работу функции на примере файла config_r1.txt.


Обратите внимание, что в данном случае, можно не проверять корректность IP-адреса,
диапазоны адресов и так далее, так как обрабатывается вывод команды,
а не ввод пользователя.

"""

import re

int_line = 'ip address 10.1.1.1 255.255.255.255'

def get_ip_from_cfg(name_file):
    
    #regex = re.compile(r'ip address +(?P<ip>\S) +(?P<mask>\S)')
    
    with open(name_file, 'r') as f1:
        result = []
        for line in f1:
            match = re.search(r'ip address (\S+) (\S+)', line)
            if match:
                #print(match.group())
                result.append(match.groups())
        return result
    
if __name__ == '__main__':
    name_file = input()  # config_r1.txt
    get_ip_from_cfg(name_file)







